grevaillot/svd_tools/headers/STM32F410/memorymap.h
#pragma once 

#define TIM5_BASE			(0x40000c00)
#define TIM6_BASE			(0x40001000)
#define LPTIM1_BASE			(0x40002400)
#define RTC_BASE			(0x40002800)
#define WWDG_BASE			(0x40002c00)
#define IWDG_BASE			(0x40003000)
#define SPI2_BASE			(0x40003800)
#define USART2_BASE			(0x40004400)
#define I2C1_BASE			(0x40005400)
#define I2C2_BASE			(0x40005800)
#define I2C4_BASE			(0x40006000)
#define PWR_BASE			(0x40007000)
#define DAC_BASE			(0x40007400)
#define TIM1_BASE			(0x40010000)
#define TIM8_BASE			(0x40010400)
#define USART1_BASE			(0x40011000)
#define USART6_BASE			(0x40011400)
#define ADC1_BASE			(0x40012000)
#define ADC_Common_BASE			(0x40012300)
#define SPI1_BASE			(0x40013000)
#define SYSCFG_BASE			(0x40013800)
#define EXTI_BASE			(0x40013c00)
#define TIM9_BASE			(0x40014000)
#define TIM11_BASE			(0x40014800)
#define SPI5_BASE			(0x40015000)
#define GPIOA_BASE			(0x40020000)
#define GPIOB_BASE			(0x40020400)
#define GPIOC_BASE			(0x40020800)
#define GPIOH_BASE			(0x40021c00)
#define CRC_BASE			(0x40023000)
#define RCC_BASE			(0x40023800)
#define FLASH_BASE			(0x40023c00)
#define DMA1_BASE			(0x40026000)
#define DMA2_BASE			(0x40026400)
#define RNG_BASE			(0x40080000)
#define SCB_ACTRL_BASE			(0xe000e008)
#define STK_BASE			(0xe000e010)
#define NVIC_BASE			(0xe000e100)
#define SCB_BASE			(0xe000ed00)
#define FPU_CPACR_BASE			(0xe000ed88)
#define MPU_BASE			(0xe000ed90)
#define NVIC_STIR_BASE			(0xe000ef00)
#define FPU_BASE			(0xe000ef34)
#define DBG_BASE			(0xe0042000)
